tutorials/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/system/topoSetDict-selectBottom
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    floatingObjectBottom;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   floatingObject;
    }

    {
        name    floatingObjectBottom;
        type    faceSet;
        action  subset;
        source  normalToFace;
        normal  (0 1 0);  // Vector
        cos     0.01;     // Tolerance (max cos of angle)
    }
);


// ************************************************************************* //
